<!-- ------------------------------------------------------------------- -->
<!--                                                                     -->
<!--  gpd2obj.xml           XMod documentation            Chris Wensley  -->
<!--                                                                     -->
<!--  Copyright (C) 2001-2017, Chris Wensley et al,                      --> 
<!--  School of Computer Science, Bangor University, U.K.                --> 
<!--                                                                     -->
<!-- ------------------------------------------------------------------- -->

<?xml version="1.0" encoding="UTF-8"?>

<Chapter Label="chap-gpd2o">

<Heading>Crossed modules of groupoids</Heading>

<Index>crossed module of groupoids</Index>

<Section> 

<Heading>Constructions for crossed modules of groupoids</Heading>

<Index>crossed module over a groupoid</Index>
<Index>2dimensional-domain with objects</Index>

A typical example of a crossed module <M>\mathcal{X}</M> 
over a groupoid has for its range a connected groupoid. 
This is a direct product of a group with a complete graph,
and we call the vertices of the graph the <E>objects</E> 
of the crossed module. 
The source of <M>\mathcal{X}</M> is a totally disconnected groupoid, 
with the same objects. 
The boundary morphism is constant on objects. 
For details and other references see <Cite Key="AW2" />. 

<ManSection>
   <Oper Name="DiscreteNormalPreXModWithObjects" 
         Arg="gpd N" /> 
   <Oper Name="PreXModWithObjectsObj" 
         Arg="obs bdy act" /> 
<Description> 
At present the experimental operation <C>DiscreteNormalPreXModWithObjects</C> 
accepts a groupoid <C>gpd</C>, which is the direct product of a group <M>G</M> 
with a connected groupoid, and a normal subgroup <M>N \unlhd G</M>. 
As such, it is the groupoid equivalent of <C>XModByNormalSubgroup</C>. 
Other constructions will be added as time permits. 
</Description>
</ManSection>
<P/>
<Example>
<![CDATA[
gap> Ga4 := SinglePieceGroupoid( a4, [-9,-8,-7] );;
gap> Display( Ga4 );
single piece groupoid: 
  objects: [ -9, -8, -7 ]
    group: a4 = <[ (1,2,3), (2,3,4) ]>
gap> SetName( Ga4, "Ga4" );; 
gap> k4 := Subgroup( a4, [ (1,2)(3,4), (1,3)(2,4) ] );; 
gap> SetName( k4, "k4" );
gap> PX0 := DiscreteNormalPreXModWithObjects( Ga4, k4 );;
gap> Print( PX0, "\n" );
[perm homogeneous, discrete groupoid: < k4, [ -9, -8, -7 ] >
->  Ga4]
gap> IsXMod( PX0 ); 
true
gap> SX0 := Source( PX0 );;
gap> SetName( SX0, "3(k4)" );; 
gap> Name( PX0 );
"[3(k4)->Ga4]"
gap> KnownPropertiesOfObject( PX0 );
[ "IsEmpty", "IsTrivial", "IsNonTrivial", "IsFinite", 
  "CanEasilyCompareElements", "CanEasilySortElements", "IsDuplicateFree", 
  "IsGeneratorsOfSemigroup", "IsPreXModDomain", "IsPerm2DimensionalGroup", 
  "IsPreXMod", "IsXMod", "IsPreXModWithObjects" ]
gap> KnownAttributesOfObject( PX0 ); 
[ "Name", "Range", "Source", "Boundary", "ObjectList", "XModAction" ]
gap> Size(PX0);
[ 12, 108 ]
gap> IsPermXMod(PX0);
true
gap> r := Arrow( Ga4, (1,3,4), -7, -8 ); 
[(1,3,4) : -7 -> -8]
gap> s := Arrow( SX0, (1,3)(2,4), -8, -8 ); 
[(1,3)(2,4) : -8 -> -8]
gap> ims := ImageElmXModAction( PX0, s, r );
[(1,4)(2,3) : -7 -> -7]
]]>
</Example>


</Section>

</Chapter>
